{
	"format": "layers-model",
	"generatedBy": "keras v2.2.4-tf",
	"convertedBy": "TensorFlow.js Converter v1.6.0",
	"modelTopology": {
		"keras_version": "2.2.4-tf",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Model",
			"config": {
				"name": "model",
				"layers": [
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								3,
								224,
								224
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "input_0"
						},
						"name": "input_0",
						"inbound_nodes": []
					},
					{
						"class_name": "ZeroPadding2D",
						"config": {
							"name": "321_pad",
							"trainable": true,
							"dtype": "float32",
							"padding": [
								[
									3,
									3
								],
								[
									3,
									3
								]
							],
							"data_format": "channels_first"
						},
						"name": "321_pad",
						"inbound_nodes": [
							[
								[
									"input_0",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "321",
							"trainable": true,
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [
								7,
								7
							],
							"strides": [
								2,
								2
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "321",
						"inbound_nodes": [
							[
								[
									"321_pad",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "322",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "322",
						"inbound_nodes": [
							[
								[
									"321",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "323",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "323",
						"inbound_nodes": [
							[
								[
									"322",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "ZeroPadding2D",
						"config": {
							"name": "324_pad",
							"trainable": true,
							"dtype": "float32",
							"padding": [
								[
									1,
									1
								],
								[
									1,
									1
								]
							],
							"data_format": "channels_first"
						},
						"name": "324_pad",
						"inbound_nodes": [
							[
								[
									"323",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "324",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [
								3,
								3
							],
							"padding": "valid",
							"strides": [
								2,
								2
							],
							"data_format": "channels_first"
						},
						"name": "324",
						"inbound_nodes": [
							[
								[
									"324_pad",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "325",
							"trainable": true,
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "325",
						"inbound_nodes": [
							[
								[
									"324",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "326",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "326",
						"inbound_nodes": [
							[
								[
									"325",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "327",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "327",
						"inbound_nodes": [
							[
								[
									"326",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "ZeroPadding2D",
						"config": {
							"name": "328_pad",
							"trainable": true,
							"dtype": "float32",
							"padding": [
								[
									1,
									1
								],
								[
									1,
									1
								]
							],
							"data_format": "channels_first"
						},
						"name": "328_pad",
						"inbound_nodes": [
							[
								[
									"327",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "328",
							"trainable": true,
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "328",
						"inbound_nodes": [
							[
								[
									"328_pad",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "329",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "329",
						"inbound_nodes": [
							[
								[
									"328",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "330",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "330",
						"inbound_nodes": [
							[
								[
									"329",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "331",
							"trainable": true,
							"dtype": "float32",
							"filters": 256,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "331",
						"inbound_nodes": [
							[
								[
									"330",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "333",
							"trainable": true,
							"dtype": "float32",
							"filters": 256,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "333",
						"inbound_nodes": [
							[
								[
									"324",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "332",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "332",
						"inbound_nodes": [
							[
								[
									"331",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "334",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "334",
						"inbound_nodes": [
							[
								[
									"333",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Add",
						"config": {
							"name": "335",
							"trainable": true,
							"dtype": "float32"
						},
						"name": "335",
						"inbound_nodes": [
							[
								[
									"332",
									0,
									0,
									{}
								],
								[
									"334",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "336",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "336",
						"inbound_nodes": [
							[
								[
									"335",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "337",
							"trainable": true,
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "337",
						"inbound_nodes": [
							[
								[
									"336",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "338",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "338",
						"inbound_nodes": [
							[
								[
									"337",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "339",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "339",
						"inbound_nodes": [
							[
								[
									"338",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "ZeroPadding2D",
						"config": {
							"name": "340_pad",
							"trainable": true,
							"dtype": "float32",
							"padding": [
								[
									1,
									1
								],
								[
									1,
									1
								]
							],
							"data_format": "channels_first"
						},
						"name": "340_pad",
						"inbound_nodes": [
							[
								[
									"339",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "340",
							"trainable": true,
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "340",
						"inbound_nodes": [
							[
								[
									"340_pad",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "341",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "341",
						"inbound_nodes": [
							[
								[
									"340",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "342",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "342",
						"inbound_nodes": [
							[
								[
									"341",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "343",
							"trainable": true,
							"dtype": "float32",
							"filters": 256,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "343",
						"inbound_nodes": [
							[
								[
									"342",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "344",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "344",
						"inbound_nodes": [
							[
								[
									"343",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Add",
						"config": {
							"name": "345",
							"trainable": true,
							"dtype": "float32"
						},
						"name": "345",
						"inbound_nodes": [
							[
								[
									"344",
									0,
									0,
									{}
								],
								[
									"336",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "346",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "346",
						"inbound_nodes": [
							[
								[
									"345",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "347",
							"trainable": true,
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "347",
						"inbound_nodes": [
							[
								[
									"346",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "348",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "348",
						"inbound_nodes": [
							[
								[
									"347",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "349",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "349",
						"inbound_nodes": [
							[
								[
									"348",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "ZeroPadding2D",
						"config": {
							"name": "350_pad",
							"trainable": true,
							"dtype": "float32",
							"padding": [
								[
									1,
									1
								],
								[
									1,
									1
								]
							],
							"data_format": "channels_first"
						},
						"name": "350_pad",
						"inbound_nodes": [
							[
								[
									"349",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "350",
							"trainable": true,
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "350",
						"inbound_nodes": [
							[
								[
									"350_pad",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "351",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "351",
						"inbound_nodes": [
							[
								[
									"350",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "352",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "352",
						"inbound_nodes": [
							[
								[
									"351",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "353",
							"trainable": true,
							"dtype": "float32",
							"filters": 256,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "353",
						"inbound_nodes": [
							[
								[
									"352",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "354",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "354",
						"inbound_nodes": [
							[
								[
									"353",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Add",
						"config": {
							"name": "355",
							"trainable": true,
							"dtype": "float32"
						},
						"name": "355",
						"inbound_nodes": [
							[
								[
									"354",
									0,
									0,
									{}
								],
								[
									"346",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "356",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "356",
						"inbound_nodes": [
							[
								[
									"355",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "357",
							"trainable": true,
							"dtype": "float32",
							"filters": 128,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "357",
						"inbound_nodes": [
							[
								[
									"356",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "358",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "358",
						"inbound_nodes": [
							[
								[
									"357",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "359",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "359",
						"inbound_nodes": [
							[
								[
									"358",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "ZeroPadding2D",
						"config": {
							"name": "360_pad",
							"trainable": true,
							"dtype": "float32",
							"padding": [
								[
									1,
									1
								],
								[
									1,
									1
								]
							],
							"data_format": "channels_first"
						},
						"name": "360_pad",
						"inbound_nodes": [
							[
								[
									"359",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "360",
							"trainable": true,
							"dtype": "float32",
							"filters": 128,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								2,
								2
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "360",
						"inbound_nodes": [
							[
								[
									"360_pad",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "361",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "361",
						"inbound_nodes": [
							[
								[
									"360",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "362",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "362",
						"inbound_nodes": [
							[
								[
									"361",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "363",
							"trainable": true,
							"dtype": "float32",
							"filters": 512,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "363",
						"inbound_nodes": [
							[
								[
									"362",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "365",
							"trainable": true,
							"dtype": "float32",
							"filters": 512,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								2,
								2
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "365",
						"inbound_nodes": [
							[
								[
									"356",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "364",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "364",
						"inbound_nodes": [
							[
								[
									"363",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "366",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "366",
						"inbound_nodes": [
							[
								[
									"365",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Add",
						"config": {
							"name": "367",
							"trainable": true,
							"dtype": "float32"
						},
						"name": "367",
						"inbound_nodes": [
							[
								[
									"364",
									0,
									0,
									{}
								],
								[
									"366",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "368",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "368",
						"inbound_nodes": [
							[
								[
									"367",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "369",
							"trainable": true,
							"dtype": "float32",
							"filters": 128,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "369",
						"inbound_nodes": [
							[
								[
									"368",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "370",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "370",
						"inbound_nodes": [
							[
								[
									"369",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "371",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "371",
						"inbound_nodes": [
							[
								[
									"370",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "ZeroPadding2D",
						"config": {
							"name": "372_pad",
							"trainable": true,
							"dtype": "float32",
							"padding": [
								[
									1,
									1
								],
								[
									1,
									1
								]
							],
							"data_format": "channels_first"
						},
						"name": "372_pad",
						"inbound_nodes": [
							[
								[
									"371",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "372",
							"trainable": true,
							"dtype": "float32",
							"filters": 128,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "372",
						"inbound_nodes": [
							[
								[
									"372_pad",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "373",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "373",
						"inbound_nodes": [
							[
								[
									"372",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "374",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "374",
						"inbound_nodes": [
							[
								[
									"373",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "375",
							"trainable": true,
							"dtype": "float32",
							"filters": 512,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "375",
						"inbound_nodes": [
							[
								[
									"374",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "376",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "376",
						"inbound_nodes": [
							[
								[
									"375",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Add",
						"config": {
							"name": "377",
							"trainable": true,
							"dtype": "float32"
						},
						"name": "377",
						"inbound_nodes": [
							[
								[
									"376",
									0,
									0,
									{}
								],
								[
									"368",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "378",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "378",
						"inbound_nodes": [
							[
								[
									"377",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "379",
							"trainable": true,
							"dtype": "float32",
							"filters": 128,
							"kernel_size": [
								1,
								1
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "379",
						"inbound_nodes": [
							[
								[
									"378",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "380",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
							"momentum": 0.8999999761581421,
							"epsilon": 0.000009999999747378752,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "380",
						"inbound_nodes": [
							[
								[
									"379",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "381",
							"trainable": true,
							"dtype": "float32",
							"activation": "relu"
						},
						"name": "381",
						"inbound_nodes": [
							[
								[
									"380",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "ZeroPadding2D",
						"config": {
							"name": "382_pad",
							"trainable": true,
							"dtype": "float32",
							"padding": [
								[
									1,
									1
								],
								[
									1,
									1
								]
							],
							"data_format": "channels_first"
						},
						"name": "382_pad",
						"inbound_nodes": [
							[
								[
									"381",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "382",
							"trainable": true,
							"dtype": "float32",
							"filters": 128,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_first",
							"dilation_rate": [
								1,
								1
							],
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "382",
						"inbound_nodes": [
							[
								[
									"382_pad",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "383",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								1
							],
